In [3]:
import numpy as np
import pandas as pd

In [12]:
d = {'A':[1,2,np.nan],'B':[4,np.nan,np.nan],'C':[7,8,9]}

In [13]:
df = pd.DataFrame(d)

In [14]:
df

     A    B  C
0  1.0  4.0  7
1  2.0  NaN  8
2  NaN  NaN  9

In [16]:
df.dropna()

     A    B  C
0  1.0  4.0  7

In [17]:
df.dropna(axis=1)

   C
0  7
1  8
2  9

In [18]:
df.fillna(value=0)

     A    B  C
0  1.0  4.0  7
1  2.0  0.0  8
2  0.0  0.0  9

In [19]:
# Create dataframe
data = {'Company':['GOOG','GOOG','MSFT','MSFT','FB','FB'],
       'Person':['Sam','Charlie','Amy','Vanessa','Carl','Sarah'],
       'Sales':[200,120,340,124,243,350]}

In [21]:
df = pd.DataFrame(data)

In [22]:
df

  Company   Person  Sales
0    GOOG      Sam    200
1    GOOG  Charlie    120
2    MSFT      Amy    340
3    MSFT  Vanessa    124
4      FB     Carl    243
5      FB    Sarah    350

In [23]:
df.groupby('Company').sum()

         Sales
Company
FB         593
GOOG       320
MSFT       464